// Необходимо реализовать упрощенную версию стандартного метода Promise.all.

// Допустим, у нас есть три промиса:

// p1 резолвится значением "🍎" через 2 секунды
// p2 резолвится значением "🍋" через 3 секунды
// p3 резолвится значением "🍉" через 1 секунду
// Функция all принимает массив промисов и возвращает новый промис.
// Через 3 секунды он резолвится масивом результатов переданных промисов. Порядок значений должен соответствовать порядку промисов в массиве.

// Гарантируется, что входящие промисы никогда не станут rejected.

const rand = () => Math.random() * 2000;

const p1 = new Promise((r) => setTimeout(r, rand(), "A"));
const p2 = new Promise((r) => setTimeout(r, rand(), "B"));
const p3 = new Promise((r) => setTimeout(r, rand(), "C"));
const p4 = new Promise((r) => setTimeout(r, rand(), "D"));

all([p1, p2, p3]).then((arr) => {
  console.log(arr); // arr === ["🍎", "🍋", "🍉"]
});

function all(promises) {
  return new Promise((resolve, reject) => {
    const inner = Array.from(promises);

    if (inner.length === 0) {
      resolve([]);
      return;
    }

    let result = [];
    let count = 0;
    const promiseLength = inner.length;

    for (let i = 0; i < inner.length; i++) {
      // Promise.resolve() обернёт и промисы, и непромисы
      Promise.resolve(inner[i])
        .then((value) => {
          result[i] = value;
          count++;
          if (count === promiseLength) {
            resolve(result);
          }
        })
        .catch(reject); // Короче и эффективнее
    }
  });
}
