// Функция race принимает iterable, например, Array или Set. У iterable нет длины, но,
// например, по нему можно пройти циклом for-of.
// Функция race возвращает промис, который завершается значением и
// статусом первого завершившегося промиса из коллекции. Если в iterable есть элементы,
// не являющиеся промисом, то
// итоговый промис зарезолвится первым из них.

// Пример 1
// p1 резолвится значением "🐎" через 2 секунды
// p2 резолвится значением "🐢" через 5 секунд
// p3 реджектится значением "👻" через 1 секунду
// Тогда race принимает эти промисы и возвращает новый промис. Через 1 секунду он реджектится значением "👻"

// Пример 2
// Теперь пусть в коллекции 3 таких промиса:

// p1 резолвится значением "🐎" через 2 секунды
// p2 резолвится значением "🐢" через 5 секунд
// p3 реджектится значением "👻" через 3 секунды
// Тогда race принимает эти промисы и возвращает новый промис. Через 2 секунды он резолвится значением "🐎"

const rand = () => Math.random() * 2000;

const p1 = new Promise((r) => setTimeout(r, rand(), "A"));
const p2 = new Promise((r) => setTimeout(r, rand(), "B"));
const p3 = new Promise((r) => setTimeout(r, rand(), "C"));
const p4 = new Promise((r) => setTimeout(r, rand(), "D"));

race([p1, p2, p3, p4]).then(
  (value) => console.log("1 >>>", value),
  (reason) => console.log("2 >>>", reason)
);

race([1, 2, 3]).then((res) => console.log(res));

function race(iterable) {
  return new Promise((resolve, reject) => {
    let hasElements = false;

    for (const item of iterable) {
      hasElements = true;

      // Не-промисы резолвятся немедленно
      if (!(item instanceof Promise)) {
        resolve(item);
        return; // Можно выйти (хотя Promise игнорирует повторные вызовы)
      }

      // Промисы обрабатываем
      item.then(resolve, reject);
    }

    // Если iterable пустой - промис висит вечно
    // (ничего не делаем)
  });
}
